/* 
  Model.strings
  Secrets

  Created by Paulo Andrade on 23/01/14.
  Copyright (c) 2016 Outer Corner. All rights reserved.
*/


// Generic
"Generic.InvalidValue" = "Valor inválido para %@";
"Generic.CreationDate" = "Criado";
"Generic.ModificationDate" = "Modificado";
"Generic.Notes" = "Notas";
"Generic.Tags" = "Tags";
"Generic.Secret.Single" = "Segredo";
"Generic.Secret.Plural" = "Segredos";

/* Item title after a copy */
"Generic.CopiedItemName" = "Cópia de %@";

// Credentials
"Credential.Single" = "Login";
"Credential.Plural" = "Logins";
"Credential.New" = "Novo Login";
"Credential.Items" = "%d login(s)";

"Credential.Properties.identifier" = "Nome de Usuário";
"Credential.Properties.secret" = "Senha";
"Credential.Properties.secrets" = "Histórico de Senhas";
"Credential.Properties.services" = "Serviços";
"Credential.Properties.tags" = "Tags";

// Softwared licenses
"SoftwareLicense.Single" = "Licença de Software";
"SoftwareLicense.Plural" = "Licenças de Software";
"SoftwareLicense.Software" = "Software";
"SoftwareLicense.License.Single" = "Licença";
"SoftwareLicense.New" = "Nova Licença";
"SoftwareLicense.Items" = "%d licença(s)";

"SoftwareLicense.Properties.key" = "Chave de Licença";
"SoftwareLicense.Properties.orderNumber" = "Número do Pedido";
"SoftwareLicense.Properties.orderTotal" = "Total do Pedido";
"SoftwareLicense.Properties.owner" = "Proprietário da Licença";
"SoftwareLicense.Properties.publisher" = "Fornecedor";
"SoftwareLicense.Properties.purchaseDate" = "Data de Compra";
"SoftwareLicense.Properties.supportEmail" = "E-mail de Suporte";
"SoftwareLicense.Properties.version" = "Versão do Software";
"SoftwareLicense.Properties.website" = "Website";

// Wallet
"Wallet.Single" = "Carteira";
"WalletItem.Single" = "Item da Carteira";
"WalletItem.Plural" = "Itens da Carteira";
"Wallet.Items" = "%d item(ns) da Carteira";

// Bank Account
"BankAccount.Single" = "Conta Bancária";
"BankAccount.Plural" = "Contas Bancárias";
"BankAccount.New" = "Nova Conta Bancária";

"BankAccount.Properties.accountHolder" = "Titular da Conta";
"BankAccount.Properties.bankName" = "Banco";
"BankAccount.Properties.iban" = "IBAN";
"BankAccount.Properties.number" = "Número da Conta";
"BankAccount.Properties.routingNumber" = "Número de Roteamento";
"BankAccount.Properties.swiftCode" = "SWIFT";

// Credit card
"CreditCard.Single" = "Cartão de Crédito";
"CreditCard.Plural" = "Cartões de Crédito";
"CreditCard.New" = "Novo Cartão de Crédito";

"CreditCard.Brand.visa" = "Visa";
"CreditCard.Brand.mastercard" = "MasterCard";
"CreditCard.Brand.amex" = "American Express";
"CreditCard.Brand.diners" = "Diners Club";
"CreditCard.Brand.discover" = "Discover";
"CreditCard.Brand.jcb" = "JCB";
"CreditCard.Brand.solo" = "Solo";
"CreditCard.Brand.maestro" = "Maestro";
"CreditCard.Brand.visaelectron" = "Visa Electron";
"CreditCard.Brand.other" = "Outro";

"CreditCard.Properties.pan" = "Número do Cartão";
"CreditCard.Properties.cardholder" = "Titular do Cartão";
"CreditCard.Properties.expirationDate" = "Data de Expiração";
"CreditCard.Properties.brand" = "Bandeira";
"CreditCard.Properties.pin" = "PIN";
"CreditCard.Properties.securityCode" = "Código de Segurança";

"CreditCard.Errors.InvalidPAN" = "O número do cartão de crédito deve ser uma sequência de dígitos";

// Notes
"Note.Single" = "Nota";
"Note.Plural" = "Notas";
"Note.New" = "Nova Nota";
"Note.Items" = "%d nota(s)";

// Service
"Service.URL" = "URL";

"Service.Properties.address" = "endereço";

"Service.Errors.InvalidAddress" = "Um endereço de serviço deve ser um URL válido";

// One-Time Passwords
"OneTimePassword.Single" = "Senha de Uso Único";
"OneTimePassword.Plural" = "Senhas de Uso Único";
"OneTimePassword.Seed.Long" = "Segredo de Senha de Uso Único";
"OneTimePassword.Seed.Short" = "Segredo de SUU";

